<script setup lang="ts">
useHead({
	title: "Раковарня",
});
</script>

<template>
	<div class="main_wrapper">
		<h1>Раковарня Красный рак</h1>
		<div class="description_wrapper">
			<img class="main_image" src="main.jpg" alt="Red Raki" />
			<div class="main_description">
				<p>
					В Раковарне «Красный рак» вы можете заказать отменных вареных и живых
					раков. Наш главный принцип: варить только живого рака, только после
					получения от Вас заказа и только по проверенным классическим рецептам.
				</p>
				<p>
					Варку раков мы производим из высококачественного сырья прошедшего
					сертификацию и соотвествующего всем нормам и требованиям СанПин. Мы не
					экономим на Вашем здоровье, но экономим ваше время и деньги, что бы вы
					отдыхали наслаждаясь вкусом приготовленных нами раков.
				</p>
				<p>
					Если вы желаете сами приготовить раков, то мы рады помочь вам в этом.
					Для этого мы доставим вам живых раков.
				</p>
				<p>
					Купить наших варёных и живых раков, креветок, крабов, а так же наборы
					специй для самостоятельной варки можно в Мытищах, в Королёве, в
					Юбилейном, в Пироговском, в Пушкино.
				</p>
        <p>
          Наши цены вас приятно удивят, как и ассортимент и превосходное качество
          продаваемого нами товара.
        </p>
        <p>
          У нас имеются рассчитанные маршруты, поэтому вы можете быть уверены в том,
          что вы получите заказ в самые короткие сроки.
        </p>
        <p>
          Мы не ВАРИМ РАКОВ ЗАРАНЕЕ, МЫ ВАРИМ ТОЛЬКО ЖИВОГО РАКА И ПОД ВАШ ЗАКАЗ!
        </p>
        <p>
          Чтобы заказать раков в Мытищинской раковарне «Красный рак» вам достаточно
          позвонить по телефону: +7 926 540 34 44 и сообщить оператору каких раков,
          в каком количестве и куда доставить. Так же вы можете заказать обратный
          звонок и оператор сам перезвонит вам и уточнит детали заказа, поможет с
          выбором.
        </p>
			</div>
		</div>
		Раковарня принимает заказы ежедневно: Пн с 12:00 до 21:00 Вт с 12:00 до
		21:00 Ср с 12:00 до 21:00 Чт с 12:00 до 21:00 Пт с 12:00 до 22:00 Сб с 12:00
		до 22:00 Вс с 12:00 до 21:00 Стоимость доставки: При заказе от 3-х кг рака
		бесплатная доставка по г. Мытищи! Доставка по г. Мытищи - 250₽ Доставка в
		г.Королев, Пирогово, д.Беляниново, д.Бородино, д.Ховрино, д.Болтино,
		п.Вешки, п.Нагорное - 400₽ Доставка в мкр. Юбилейный, метро Медведково,
		п.Челюскинский, с. Тарасовка, п.Лесные поляны, д.Афанасово - 450₽ Доставка
		до станции метро Бабушкинская, метро Свиблово, п. Загорянский, Долгопрудный
		- 550₽ Доставка в д.Осташково, д.Никульское, д.Подрезово, д. Жостово,
		д.Сорокино, д.Чиверево,с.Троицкое (Золотой город), кот.пос. Жуковка,
		д.Куркино, Ивантеевка, Пушкино - 600₽ Доставка в г.Щелково, г. Балашиха,
		г.Химки - 900₽ Доставка в г. Фрязино - 1400₽ Доставка раков по Московской
		области на большие расстояния оговаривается отдельно по телефону +7
		926-540-34-44 При оплате через Сбербанк-Онлайн возможна отправка через
		службу такси, что сокращает время доставки. Стоимость доставки оплачивается
		по тарифу перевозчика. Вам всего лишь нужно встретить водителя. Подробности
		этого варианта доставки можно узнать позвонив нам! Минимальный объем заказа
		- от 1 кг Оплата заказа производится наличными курьеру. Если Вам потребуется
		сдача, скажите об этом оператору при оформлении заказа. При получении
		заказа, оплатите его в соответствии с накладной, затем примите заказ,
		проверьте комплектность и только убедившись что все в порядке, отпускайте
		курьера.
	</div>
</template>

<style lang="scss" scoped>
.main_wrapper {
	background-color: whitesmoke;
	border: 1px solid aqua;
	border-radius: 5px;
  h1 {
    font-size: 2rem;
    font-weight: 500;
    text-align: center;
    margin-bottom: 1rem;
  }
	.description_wrapper {
		display: grid;
		grid-template-areas: "image description" "image description";
    gap: 1rem;
		.main_image {
			grid-area: image;
		}
		.main_description {
			grid-area: description;
		}
	}
	img {
		width: 100%;
	}
}
</style>
